package com.jjava.lecture.ch03;

public class Operator {

	public static void main(String[] args) {

	//연산자 : +, -, *, /
	//피연산자 : 데이터
	//c+ = a+b
		
	//연산의 방향
	//<-- : right to left : 증감, 부호, 비트, 논리, 대입
	//--> : left to right : 산술, 쉬프트, 비교, 논리, 조건(대부분)
		
	//연산의 우선 순위
	//중감(++, --), 부호(+,-), 비트(~), 논리(!)
	//산술(*,/,%)
	//산술(+,-)
	//쉬프트(>>,<<,>>>)
	//비교(<,>,<=,=>,instenceof)
	//논리(==, !=)
	//논리(&)
	//논리(^)
	//논리(|)
	//논리(&&)
	//논리(||)
	//조건(?)
	//대입(=,+=,-=,*=,/=,%=,&=,^=,|=,<<=,>>=,>>>=)
		
	//연산의 우선 순위
	// ()로 적절히 우선 순위를 잡아서 사용하는 것이 중요
		
	//항 = 피연산자 = 데이터
	//단항연산자 : 부호연산자(+,-) /  증감연산자(++,--) / 논리부정연산자(!) / 비트반전연산자(~)

	//이항연산자(피연산자가 두 개인 것) :  산술연산자(+,-,*,/,%), 문자연결연산자(+), 비교연산자()
	//비교연산자(동등비교(==, !=)와 크기비교(<,>,<=,=>)와 string 비교)	
	//논리연산자(&&, ||, &, |, ^, !), 비트연산자(<<,>>,>>>)
	//대입연산자(단순대입(=), 복합대입(+=. -=, *=. /=, %= 등)

	//삼항연산자(피연산자가 세 개인 것)
	//(? : ) ** 
	}

}
